jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/hal_i2c.cpp
static void i2c_gpio_write(uint8_t pin, bool high) {
  const uint32_t port = i2c_pin_port(pin);
  const uint32_t n = i2c_pin_num(pin);
  if (port > 6u) {
    return;
  }
  GPIO_BSRR(port) = high ? (1u << n) : (1u << (n + 16u));
}

static bool i2c_gpio_read(uint8_t pin) {
  const uint32_t port = i2c_pin_port(pin);
  const uint32_t n = i2c_pin_num(pin);
  if (port > 6u) {
    return false;
  }
  return (GPIO_IDR(port) & (1u << n)) != 0u;
}

static void i2c_bus_clear_delay(void) {
  for (volatile uint32_t i = 0u; i < 80u; ++i) {
#if defined(__arm__) || defined(__thumb__)
    __asm volatile("nop");
#endif
  }
}

static uint32_t i2c_timing_from_clock(uint32_t clock_hz) {
  if (clock_hz >= HAL_I2C_CLOCK_FAST_PLUS_HZ) {
    return I2C_TIMINGR_1M_16MHZ;
  }
  if (clock_hz >= HAL_I2C_CLOCK_FAST_HZ) {
    return I2C_TIMINGR_400K_16MHZ;
  }
  return I2C_TIMINGR_100K_16MHZ;
}

static void i2c_hw_apply_clock(uint32_t base, uint32_t clock_hz) {
  I2C_CR1_REG(base) &= ~I2C_CR1_PE;
  I2C_TIMINGR_REG(base) = i2c_timing_from_clock(clock_hz);
  I2C_CR1_REG(base) |= I2C_CR1_PE;
}

static bool i2c_hw_configure_bus(i2c_bus_state_t *st, const i2c_hw_desc_t *desc,
                                 uint8_t requested_sda_pin,
                                 uint8_t requested_scl_pin) {
  uint8_t sda_pin = requested_sda_pin;
  uint8_t scl_pin = requested_scl_pin;

  if (sda_pin == 0u) {
    sda_pin = desc->default_sda_pin;
  }
  if (scl_pin == 0u) {
    scl_pin = desc->default_scl_pin;
  }

  uint8_t sda_af = 0u;
  uint8_t scl_af = 0u;
  if (!i2c_pin_find_af(desc->controller, true, sda_pin, &sda_af) ||
      !i2c_pin_find_af(desc->controller, false, scl_pin, &scl_af)) {
    st->hw_base = 0u;
    st->hw_rcc_mask = 0u;
    return false;
  }

  st->sda_pin = sda_pin;
  st->scl_pin = scl_pin;
  st->hw_base = desc->base;
  st->hw_rcc_mask = desc->rcc_mask;

  RCC_APB1ENR1 |= st->hw_rcc_mask;
  (void)RCC_APB1ENR1;

  i2c_gpio_set_af_od_pullup(st->scl_pin, scl_af);
  i2c_gpio_set_af_od_pullup(st->sda_pin, sda_af);
  i2c_hw_apply_clock(st->hw_base, st->clock_hz);
  return true;
}

static inline bool i2c_hw_ready(const i2c_bus_state_t *st) {
  return st->initialized && st->hw_base != 0u;
}

/* Master write of @p len bytes (AUTOEND). Returns HAL_I2C_* status. */
static uint8_t i2c_hw_write(uint32_t base, uint8_t addr, const uint8_t *buf,
                            int len) {
  I2C_ICR_REG(base) = I2C_ICR_NACKCF | I2C_ICR_STOPCF;
  I2C_CR2_REG(base) = ((uint32_t)addr << 1) | ((uint32_t)(uint8_t)len << 16) |
                      I2C_CR2_AUTOEND | I2C_CR2_START;
  for (int i = 0; i < len; ++i) {
    uint32_t to = I2C_TIMEOUT;
    while (!(I2C_ISR_REG(base) & (I2C_ISR_TXIS | I2C_ISR_NACKF)) && to) {
      --to;
    }
    if (to == 0u) {
      return HAL_I2C_ERROR_TIMEOUT;
    }
    if (I2C_ISR_REG(base) & I2C_ISR_NACKF) {
      break;
    }
    I2C_TXDR_REG(base) = buf[i];
  }
  uint32_t to = I2C_TIMEOUT;
  while (!(I2C_ISR_REG(base) & I2C_ISR_STOPF) && to) {
    --to;
  }
  if (to == 0u) {
    return HAL_I2C_ERROR_TIMEOUT;
  }
  const bool nack = (I2C_ISR_REG(base) & I2C_ISR_NACKF) != 0u;
  I2C_ICR_REG(base) = I2C_ICR_STOPCF | I2C_ICR_NACKCF;
  return nack ? HAL_I2C_ERROR_GENERIC : HAL_I2C_RESULT_OK;
}

/* Master read of @p len bytes (AUTOEND). Returns number of bytes received. */
static int i2c_hw_read(uint32_t base, uint8_t addr, uint8_t *buf, int len) {
  if (len <= 0) {
    return 0;
  }
  I2C_ICR_REG(base) = I2C_ICR_NACKCF | I2C_ICR_STOPCF;
  I2C_CR2_REG(base) = ((uint32_t)addr << 1) | ((uint32_t)(uint8_t)len << 16) |
                      I2C_CR2_RD_WRN | I2C_CR2_AUTOEND | I2C_CR2_START;
  int got = 0;
  for (int i = 0; i < len; ++i) {
    uint32_t to = I2C_TIMEOUT;
    while (!(I2C_ISR_REG(base) & (I2C_ISR_RXNE | I2C_ISR_NACKF)) && to) {
      --to;
    }
    if (to == 0u || (I2C_ISR_REG(base) & I2C_ISR_NACKF)) {
      break;
    }
    buf[i] = (uint8_t)I2C_RXDR_REG(base);
    ++got;
  }
  uint32_t to = I2C_TIMEOUT;
  while (!(I2C_ISR_REG(base) & I2C_ISR_STOPF) && to) {
    --to;
  }
  I2C_ICR_REG(base) = I2C_ICR_STOPCF | I2C_ICR_NACKCF;
  return got;
}

static bool i2c_hw_write_read(uint32_t base, uint8_t addr, const uint8_t *tx,
                              int tx_len, uint8_t *rx, int rx_len) {
  if (tx_len <= 0 || rx_len < 0) {
    return false;
  }
  I2C_ICR_REG(base) = I2C_ICR_NACKCF | I2C_ICR_STOPCF;
  I2C_CR2_REG(base) =
      ((uint32_t)addr << 1) | ((uint32_t)(uint8_t)tx_len << 16) | I2C_CR2_START;
  for (int i = 0; i < tx_len; ++i) {
    uint32_t to = I2C_TIMEOUT;
    while (!(I2C_ISR_REG(base) & (I2C_ISR_TXIS | I2C_ISR_NACKF)) && to) {
      --to;
    }
    if (to == 0u || (I2C_ISR_REG(base) & I2C_ISR_NACKF)) {
      I2C_ICR_REG(base) = I2C_ICR_NACKCF | I2C_ICR_STOPCF;
      return false;
    }
    I2C_TXDR_REG(base) = tx[i];
  }

  uint32_t to = I2C_TIMEOUT;
  while (!(I2C_ISR_REG(base) & (I2C_ISR_TC | I2C_ISR_NACKF)) && to) {
    --to;
  }
  if (to == 0u || (I2C_ISR_REG(base) & I2C_ISR_NACKF)) {
    I2C_ICR_REG(base) = I2C_ICR_NACKCF | I2C_ICR_STOPCF;
    return false;
  }

  if (rx_len == 0) {
    I2C_CR2_REG(base) |= I2C_CR2_STOP;
    to = I2C_TIMEOUT;
    while (!(I2C_ISR_REG(base) & I2C_ISR_STOPF) && to) {
      --to;
    }
    I2C_ICR_REG(base) = I2C_ICR_STOPCF | I2C_ICR_NACKCF;
    return to != 0u;
  }

  I2C_CR2_REG(base) = ((uint32_t)addr << 1) |
                      ((uint32_t)(uint8_t)rx_len << 16) | I2C_CR2_RD_WRN |
                      I2C_CR2_AUTOEND | I2C_CR2_START;
  int got = 0;
  for (int i = 0; i < rx_len; ++i) {
    to = I2C_TIMEOUT;
    while (!(I2C_ISR_REG(base) & (I2C_ISR_RXNE | I2C_ISR_NACKF)) && to) {
      --to;
    }
    if (to == 0u || (I2C_ISR_REG(base) & I2C_ISR_NACKF)) {
      break;
    }
    rx[i] = (uint8_t)I2C_RXDR_REG(base);
    ++got;
  }

  to = I2C_TIMEOUT;
  while (!(I2C_ISR_REG(base) & I2C_ISR_STOPF) && to) {
    --to;
  }
  I2C_ICR_REG(base) = I2C_ICR_STOPCF | I2C_ICR_NACKCF;
  return (to != 0u) && (got == rx_len);
}

/* Zero-byte probe: returns true if the device ACKs (is present). */
static bool i2c_hw_ack(uint32_t base, uint8_t addr) {
  I2C_ICR_REG(base) = I2C_ICR_NACKCF | I2C_ICR_STOPCF;
  I2C_CR2_REG(base) = ((uint32_t)addr << 1) | I2C_CR2_AUTOEND | I2C_CR2_START;
  uint32_t to = I2C_TIMEOUT;
  while (!(I2C_ISR_REG(base) & I2C_ISR_STOPF) && to) {
    --to;
  }
  const bool nack = (I2C_ISR_REG(base) & I2C_ISR_NACKF) != 0u;
  I2C_ICR_REG(base) = I2C_ICR_STOPCF | I2C_ICR_NACKCF;
  return (to != 0u) && !nack;
}
#endif /* JH_STM32G474_HW */

