jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/hal_i2c.cpp
hal_status_t hal_i2c_init_ex(uint8_t sda_pin, uint8_t scl_pin,
                             uint32_t clock_hz) {
  return hal_i2c_init_bus_ex(0, sda_pin, scl_pin, clock_hz);
}

void hal_i2c_init(uint8_t sda_pin, uint8_t scl_pin, uint32_t clock_hz) {
  const hal_status_t status = hal_i2c_init_ex(sda_pin, scl_pin, clock_hz);
  HAL_ASSERT(status == HAL_OK, "hal_i2c_init: failed to initialize bus");
}

hal_status_t hal_i2c_init_bus_ex(uint8_t bus, uint8_t sda_pin, uint8_t scl_pin,
                                 uint32_t clock_hz) {
  if (!i2c_bus_valid(bus)) {
    return HAL_EINVAL;
  }
  i2c_ensure_mutex(bus);

  i2c_bus_state_t *st = i2c_state(bus);
  st->rx_len = 0;
  st->rx_pos = 0;
  st->tx_len = 0;
  st->cur_addr = 0u;
  st->last_error = 0u;
  st->clock_hz = (clock_hz == 0u) ? HAL_I2C_CLOCK_STANDARD_HZ : clock_hz;
  st->transaction_count = 0u;
  st->bus_clear_count = 0u;
  st->sda_pin = sda_pin;
  st->scl_pin = scl_pin;
  if (st->lock_depth == 0u) {
    st->lock_owner = 0u;
  }
#ifdef JH_STM32G474_HW
  st->hw_base = 0u;
  st->hw_rcc_mask = 0u;

  const i2c_hw_desc_t *desc = i2c_hw_desc_for_bus(bus);
  if (!i2c_hw_configure_bus(st, desc, sda_pin, scl_pin)) {
    st->initialized = false;
    return HAL_ECONFIG;
  }
#endif
  st->initialized = true;
  return HAL_OK;
}

void hal_i2c_init_bus(uint8_t bus, uint8_t sda_pin, uint8_t scl_pin,
                      uint32_t clock_hz) {
  const hal_status_t status =
      hal_i2c_init_bus_ex(bus, sda_pin, scl_pin, clock_hz);
  HAL_ASSERT(status == HAL_OK,
             "hal_i2c_init_bus: invalid SDA/SCL pin mapping for selected bus");
}

void hal_i2c_set_clock(uint32_t clock_hz) {
  (void)hal_i2c_set_clock_ex(clock_hz);
}

hal_status_t hal_i2c_set_clock_ex(uint32_t clock_hz) {
  return hal_i2c_set_clock_bus_ex(0, clock_hz);
}

hal_status_t hal_i2c_set_clock_bus_ex(uint8_t bus, uint32_t clock_hz) {
  if (!i2c_bus_valid(bus)) {
    return HAL_EINVAL;
  }
  hal_i2c_set_clock_bus(bus, clock_hz);
  return HAL_OK;
}

void hal_i2c_set_clock_bus(uint8_t bus, uint32_t clock_hz) {
  i2c_ensure_mutex(bus);
  i2c_bus_state_t *st = i2c_state(bus);
  i2c_lock_state(st);
  st->clock_hz = (clock_hz == 0u) ? HAL_I2C_CLOCK_STANDARD_HZ : clock_hz;
#ifdef JH_STM32G474_HW
  if (i2c_hw_ready(st)) {
    i2c_hw_apply_clock(st->hw_base, st->clock_hz);
  }
#endif
  i2c_unlock_state(st);
}

void hal_i2c_deinit(void) { hal_i2c_deinit_bus(0); }

void hal_i2c_deinit_bus(uint8_t bus) {
  i2c_bus_state_t *st = i2c_state(bus);
  st->initialized = false;
  st->rx_len = 0;
  st->rx_pos = 0;
  st->tx_len = 0;
  st->cur_addr = 0u;
#ifdef JH_STM32G474_HW
  if (st->hw_base != 0u) {
    I2C_CR1_REG(st->hw_base) &= ~I2C_CR1_PE;
  }
  st->hw_base = 0u;
  st->hw_rcc_mask = 0u;
#endif
}

void hal_i2c_lock(void) { hal_i2c_lock_bus(0); }

void hal_i2c_lock_bus(uint8_t bus) { i2c_lock_bus(bus); }

void hal_i2c_unlock(void) { hal_i2c_unlock_bus(0); }

void hal_i2c_unlock_bus(uint8_t bus) { i2c_unlock_bus(bus); }

void hal_i2c_begin_transmission(uint8_t address) {
  hal_i2c_begin_transmission_bus(0, address);
}

void hal_i2c_begin_transmission_bus(uint8_t bus, uint8_t address) {
  i2c_lock_bus(bus);
  i2c_state(bus)->cur_addr = address;
  i2c_state(bus)->tx_len = 0;
}

size_t hal_i2c_write(uint8_t data) { return hal_i2c_write_bus(0, data); }

size_t hal_i2c_write_bus(uint8_t bus, uint8_t data) {
  i2c_bus_state_t *st = i2c_state(bus);
  if (st->tx_len >= STM32_I2C_BUF_SIZE) {
    return 0u;
  }
  st->tx_buf[st->tx_len++] = data;
  return 1u;
}

uint8_t hal_i2c_end_transmission(void) {
  return hal_i2c_end_transmission_bus(0);
}

hal_status_t hal_i2c_end_transmission_ex(void) {
  return hal_i2c_end_transmission_bus_ex(0);
}

hal_status_t hal_i2c_end_transmission_bus_ex(uint8_t bus) {
  if (!i2c_bus_valid(bus)) {
    return HAL_EINVAL;
  }
  return i2c_status_from_result(hal_i2c_end_transmission_bus(bus));
}

uint8_t hal_i2c_end_transmission_bus(uint8_t bus) {
  i2c_bus_state_t *st = i2c_state(bus);
  uint8_t err = HAL_I2C_RESULT_OK;
#ifdef JH_STM32G474_HW
  if (i2c_hw_ready(st)) {
    err = i2c_hw_write(st->hw_base, st->cur_addr, st->tx_buf, st->tx_len);
  } else {
    err = HAL_I2C_ERROR_TIMEOUT;
  }
#endif
  st->last_error = err;
  st->tx_len = 0;
  st->transaction_count++;
  i2c_unlock_bus(bus);
  return err;
}

uint8_t hal_i2c_write_byte(uint8_t address, uint8_t data, bool *outWriteOk) {
  return hal_i2c_write_byte_bus(0, address, data, outWriteOk);
}

hal_status_t hal_i2c_write_byte_ex(uint8_t address, uint8_t data,
                                   bool *outWriteOk) {
  return hal_i2c_write_byte_bus_ex(0, address, data, outWriteOk);
}

hal_status_t hal_i2c_write_byte_bus_ex(uint8_t bus, uint8_t address,
                                       uint8_t data, bool *outWriteOk) {
  if (!i2c_bus_valid(bus)) {
    if (outWriteOk != NULL) {
      *outWriteOk = false;
    }
    return HAL_EINVAL;
  }
  bool write_ok = false;
  uint8_t result = hal_i2c_write_byte_bus(bus, address, data, &write_ok);
  if (outWriteOk != NULL) {
    *outWriteOk = write_ok;
  }
  if (!write_ok) {
    return HAL_EIO;
  }
  return i2c_status_from_result(result);
}

uint8_t hal_i2c_write_byte_bus(uint8_t bus, uint8_t address, uint8_t data,
                               bool *outWriteOk) {
  hal_i2c_begin_transmission_bus(bus, address);
  size_t written = hal_i2c_write_bus(bus, data);
  if (outWriteOk != NULL) {
    *outWriteOk = (written == 1u);
  }
  return hal_i2c_end_transmission_bus(bus);
}

uint8_t hal_i2c_read_byte(uint8_t address, bool *outReadOk) {
  return hal_i2c_read_byte_bus(0, address, outReadOk);
}

hal_status_t hal_i2c_read_byte_ex(uint8_t address, uint8_t *outValue) {
  return hal_i2c_read_byte_bus_ex(0, address, outValue);
}

hal_status_t hal_i2c_read_byte_bus_ex(uint8_t bus, uint8_t address,
                                      uint8_t *outValue) {
  if (outValue == NULL) {
    return HAL_EINVAL;
  }
  *outValue = 0u;
  if (!i2c_bus_valid(bus)) {
    return HAL_EINVAL;
  }
  return hal_i2c_read_bytes_bus_ex(bus, address, outValue, 1u);
}

