jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/hal_i2c.cpp
uint8_t hal_i2c_read_byte_bus(uint8_t bus, uint8_t address, bool *outReadOk) {
  uint8_t value = 0u;
  const bool ok = hal_i2c_read_bytes_bus(bus, address, &value, 1u);
  if (outReadOk != NULL) {
    *outReadOk = ok;
  }
  return ok ? value : 0u;
}

bool hal_i2c_write_read(uint8_t address, const uint8_t *tx, size_t tx_len,
                        uint8_t *rx, size_t rx_len) {
  return hal_status_to_bool(
      hal_i2c_write_read_ex(address, tx, tx_len, rx, rx_len));
}

hal_status_t hal_i2c_write_read_ex(uint8_t address, const uint8_t *tx,
                                   size_t tx_len, uint8_t *rx, size_t rx_len) {
  return hal_i2c_write_read_bus_ex(0, address, tx, tx_len, rx, rx_len);
}

hal_status_t hal_i2c_write_read_bus_ex(uint8_t bus, uint8_t address,
                                       const uint8_t *tx, size_t tx_len,
                                       uint8_t *rx, size_t rx_len) {
  if (!i2c_bus_valid(bus) || (tx_len > 0u && tx == NULL) ||
      (rx_len > 0u && rx == NULL) || tx_len > STM32_I2C_BUF_SIZE ||
      rx_len > STM32_I2C_BUF_SIZE) {
    return HAL_EINVAL;
  }
  if (tx_len == 0u) {
    return hal_i2c_read_bytes_bus_ex(bus, address, rx, rx_len);
  }
  if (!i2c_state(bus)->initialized) {
    HAL_ASSERT(false, "hal_i2c: bus used before hal_i2c_init_bus");
    return HAL_EUNINIT;
  }
  return hal_status_from_bool(
      hal_i2c_write_read_bus(bus, address, tx, tx_len, rx, rx_len), HAL_EBUS);
}

bool hal_i2c_write_read_bus(uint8_t bus, uint8_t address, const uint8_t *tx,
                            size_t tx_len, uint8_t *rx, size_t rx_len) {
  if ((tx_len > 0u && tx == NULL) || (rx_len > 0u && rx == NULL) ||
      tx_len > 255u || rx_len > 255u) {
    return false;
  }

  i2c_bus_state_t *st = i2c_state(bus);
  i2c_lock_bus(bus);
  bool ok = true;
#ifdef JH_STM32G474_HW
  if (!i2c_hw_ready(st)) {
    i2c_unlock_bus(bus);
    return false;
  }

  ok =
      i2c_hw_write_read(st->hw_base, address, tx, (int)tx_len, rx, (int)rx_len);
  st->transaction_count += (rx_len > 0u) ? 2u : 1u;
  i2c_unlock_bus(bus);
  return ok;
#endif

  st->cur_addr = address;
  st->tx_len = 0;
  for (size_t i = 0; i < tx_len; ++i) {
    if (st->tx_len >= STM32_I2C_BUF_SIZE) {
      ok = false;
      break;
    }
    st->tx_buf[st->tx_len++] = tx[i];
  }
  st->tx_len = 0;
  st->transaction_count++;

  if (ok && rx_len > 0u) {
    st->rx_len = (int)rx_len;
    st->rx_pos = 0;
    for (size_t i = 0; i < rx_len; ++i) {
      int v = hal_i2c_read_bus(bus);
      if (v < 0) {
        ok = false;
        break;
      }
      rx[i] = (uint8_t)v;
    }
    st->transaction_count++;
  }

  i2c_unlock_bus(bus);
  return ok;
}

bool hal_i2c_read_bytes(uint8_t address, uint8_t *rx, size_t rx_len) {
  return hal_status_to_bool(hal_i2c_read_bytes_ex(address, rx, rx_len));
}

hal_status_t hal_i2c_read_bytes_ex(uint8_t address, uint8_t *rx,
                                   size_t rx_len) {
  return hal_i2c_read_bytes_bus_ex(0, address, rx, rx_len);
}

hal_status_t hal_i2c_read_bytes_bus_ex(uint8_t bus, uint8_t address,
                                       uint8_t *rx, size_t rx_len) {
  if (!i2c_bus_valid(bus) || (rx_len > 0u && rx == NULL) ||
      rx_len > STM32_I2C_BUF_SIZE) {
    return HAL_EINVAL;
  }
  if (rx_len == 0u) {
    return HAL_OK;
  }
  if (!i2c_state(bus)->initialized) {
    HAL_ASSERT(false, "hal_i2c: bus used before hal_i2c_init_bus");
    return HAL_EUNINIT;
  }
  return hal_status_from_bool(hal_i2c_read_bytes_bus(bus, address, rx, rx_len),
                              HAL_EBUS);
}

bool hal_i2c_read_bytes_bus(uint8_t bus, uint8_t address, uint8_t *rx,
                            size_t rx_len) {
  if ((rx_len > 0u && rx == NULL) || rx_len > 255u) {
    return false;
  }
  if (rx_len == 0u) {
    return true;
  }

  i2c_bus_state_t *st = i2c_state(bus);
  i2c_lock_bus(bus);
  bool ok = true;
#ifdef JH_STM32G474_HW
  if (!i2c_hw_ready(st)) {
    i2c_unlock_bus(bus);
    return false;
  }

  int got = i2c_hw_read(st->hw_base, address, rx, (int)rx_len);
  st->rx_len = 0;
  st->rx_pos = 0;
  st->transaction_count++;
  i2c_unlock_bus(bus);
  return got == (int)rx_len;
#else
  (void)address;
  memset(rx, 0, rx_len);
  st->rx_len = 0;
  st->rx_pos = 0;
  st->transaction_count++;
#endif
  i2c_unlock_bus(bus);
  return ok;
}

uint8_t hal_i2c_request_from(uint8_t address, uint8_t count) {
  return hal_i2c_request_from_bus(0, address, count);
}

hal_status_t hal_i2c_request_from_ex(uint8_t address, uint8_t count,
                                     uint8_t *outReceived) {
  return hal_i2c_request_from_bus_ex(0, address, count, outReceived);
}

hal_status_t hal_i2c_request_from_bus_ex(uint8_t bus, uint8_t address,
                                         uint8_t count, uint8_t *outReceived) {
  if (outReceived == NULL || !i2c_bus_valid(bus)) {
    return HAL_EINVAL;
  }
  *outReceived = 0u;
  if (!i2c_state(bus)->initialized && count > 0u) {
    HAL_ASSERT(false, "hal_i2c: bus used before hal_i2c_init_bus");
    return HAL_EUNINIT;
  }
  *outReceived = hal_i2c_request_from_bus(bus, address, count);
  return (*outReceived == count) ? HAL_OK : HAL_EBUS;
}

uint8_t hal_i2c_request_from_bus(uint8_t bus, uint8_t address, uint8_t count) {
  i2c_bus_state_t *st = i2c_state(bus);

  i2c_lock_bus(bus);
  /* count is uint8_t (<=255) and the rx buffer holds 255 bytes, so it always
   * fits. */
  int got = 0;
#ifdef JH_STM32G474_HW
  if (i2c_hw_ready(st)) {
    got = i2c_hw_read(st->hw_base, address, st->rx_buf, (int)count);
  } else {
    got = 0;
  }
#else
  (void)address;
  got = (int)count;
#endif
  st->rx_len = got;
  st->rx_pos = 0;
  st->transaction_count++;
  i2c_unlock_bus(bus);
  return (uint8_t)got;
}

int hal_i2c_available(void) { return hal_i2c_available_bus(0); }

int hal_i2c_available_bus(uint8_t bus) {
  i2c_bus_state_t *st = i2c_state(bus);
  return st->rx_len - st->rx_pos;
}

int hal_i2c_read(void) { return hal_i2c_read_bus(0); }

int hal_i2c_read_bus(uint8_t bus) {
  i2c_bus_state_t *st = i2c_state(bus);
  if (st->rx_pos < st->rx_len) {
    return st->rx_buf[st->rx_pos++];
  }
  return -1;
}

bool hal_i2c_is_busy(uint8_t address) {
  return hal_i2c_is_busy_bus(0, address);
}

bool hal_i2c_is_busy_bus(uint8_t bus, uint8_t address) {
#ifdef JH_STM32G474_HW
  i2c_bus_state_t *st = i2c_state(bus);
  if (i2c_hw_ready(st)) {
    i2c_lock_bus(bus);
    bool ack = i2c_hw_ack(st->hw_base, address);
    i2c_unlock_bus(bus);
    return !ack; /* busy/absent == did NOT ACK */
  }
  return true;
#endif
  (void)bus;
  (void)address;
  return false;
}

uint32_t hal_i2c_get_transaction_count(void) {
  return hal_i2c_get_transaction_count_bus(0);
}

