jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/hal_i2c.cpp
uint32_t hal_i2c_get_transaction_count_bus(uint8_t bus) {
  return i2c_state(bus)->transaction_count;
}

void hal_i2c_bus_clear(uint8_t sda_pin, uint8_t scl_pin) {
  hal_i2c_bus_clear_bus(0, sda_pin, scl_pin);
}

hal_status_t hal_i2c_bus_clear_ex(uint8_t sda_pin, uint8_t scl_pin) {
  return hal_i2c_bus_clear_bus_ex(0, sda_pin, scl_pin);
}

hal_status_t hal_i2c_bus_clear_bus_ex(uint8_t bus, uint8_t sda_pin,
                                      uint8_t scl_pin) {
  if (!i2c_bus_valid(bus)) {
    return HAL_EINVAL;
  }
#ifdef JH_STM32G474_HW
  i2c_bus_state_t *st = i2c_state(bus);
  const i2c_hw_desc_t *desc = i2c_hw_desc_for_bus(bus);
  uint8_t clear_sda = sda_pin;
  uint8_t clear_scl = scl_pin;
  if (clear_sda == 0u) {
    clear_sda = (st->sda_pin != 0u) ? st->sda_pin : desc->default_sda_pin;
  }
  if (clear_scl == 0u) {
    clear_scl = (st->scl_pin != 0u) ? st->scl_pin : desc->default_scl_pin;
  }
  if (!i2c_pin_valid(clear_sda) || !i2c_pin_valid(clear_scl)) {
    return HAL_EINVAL;
  }
#endif
  hal_i2c_bus_clear_bus(bus, sda_pin, scl_pin);
  return HAL_OK;
}

void hal_i2c_bus_clear_bus(uint8_t bus, uint8_t sda_pin, uint8_t scl_pin) {
#ifdef JH_STM32G474_HW
  i2c_bus_state_t *st = i2c_state(bus);
  const i2c_hw_desc_t *desc = i2c_hw_desc_for_bus(bus);

  uint8_t clear_sda = sda_pin;
  uint8_t clear_scl = scl_pin;

  if (clear_sda == 0u) {
    clear_sda = (st->sda_pin != 0u) ? st->sda_pin : desc->default_sda_pin;
  }
  if (clear_scl == 0u) {
    clear_scl = (st->scl_pin != 0u) ? st->scl_pin : desc->default_scl_pin;
  }

  if (!i2c_pin_valid(clear_sda) || !i2c_pin_valid(clear_scl)) {
    HAL_ASSERT(false, "hal_i2c_bus_clear_bus: invalid pin id");
    st->bus_clear_count++;
    return;
  }

  i2c_gpio_set_input_pullup(clear_sda);
  i2c_gpio_set_output_od_pullup(clear_scl);
  i2c_gpio_write(clear_scl, true);
  i2c_bus_clear_delay();

  for (uint8_t i = 0u; i < 9u; ++i) {
    if (i2c_gpio_read(clear_sda)) {
      break;
    }
    i2c_gpio_write(clear_scl, false);
    i2c_bus_clear_delay();
    i2c_gpio_write(clear_scl, true);
    i2c_bus_clear_delay();
  }

  i2c_gpio_set_output_od_pullup(clear_sda);
  i2c_gpio_write(clear_sda, false);
  i2c_bus_clear_delay();
  i2c_gpio_write(clear_scl, true);
  i2c_bus_clear_delay();
  i2c_gpio_write(clear_sda, true);
  i2c_bus_clear_delay();

  i2c_gpio_set_input_pullup(clear_sda);
  i2c_gpio_set_input_pullup(clear_scl);
#else
  (void)sda_pin;
  (void)scl_pin;
#endif

  i2c_state(bus)->bus_clear_count++;
}

#endif /* HAL_ENABLE_I2C */

#endif // HAL_TARGET_IS_STM32G474
